In [43]:
print("Hello world")

Hello world

In [2]:


import pandas as pd



import pymysql
from sqlalchemy import create_engine

In [8]:
print(pd.__version__)

2.3.2

In [9]:
df = pd.read_csv('walmart.csv',encoding_errors='ignore')
df.shape

(10051, 11)

In [10]:
df.head()
df.describe()

         invoice_id        rating   profit_margin
count  10051.000000  10051.000000    10051.000000
mean    5025.741220      5.825659        0.393791
std     2901.174372      1.763991        0.090669
min        1.000000      3.000000        0.180000
25%     2513.500000      4.000000        0.330000
50%     5026.000000      6.000000        0.330000
75%     7538.500000      7.000000        0.480000
max    10000.000000     10.000000        0.570000

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   invoice_id               10000 non-null  int64
 1    Branch                  10000 non-null  object
 2    City                    10000 non-null  object
 3    category                10000 non-null  object
 4    unit_price              9969 non-null   float64
 5    quantity                9969 non-null   float64
 6    date                    10000 non-null  object
 7    time                    10000 non-null  object
 8    payment_method          10000 non-null  object
 9    rating                  10000 non-null  float64
 10   profit_margin           10000 non-null  float64
 11   total                   9969 non-null   float64
dtypes: float64(5), int64(1), object(6)
memory usage: 1015.6+ KB

In [36]:
df.duplicated().sum()

np.int64(0)

In [37]:
df.isnull().sum()

invoice_id                 0
 Branch                    0
 City                      0
 category                  0
 unit_price                0
 quantity                  0
 date                      0
 time                      0
 payment_method            0
 rating                    0
 profit_margin             0
 total                     0
dtype: int64

In [38]:
df.drop_duplicates(inplace=True)

In [39]:
df.duplicated().sum()

np.int64(0)

In [40]:
df.shape

(9969, 12)

In [41]:
df.isnull().sum()

invoice_id                 0
 Branch                    0
 City                      0
 category                  0
 unit_price                0
 quantity                  0
 date                      0
 time                      0
 payment_method            0
 rating                    0
 profit_margin             0
 total                     0
dtype: int64

In [42]:
#droppin all rows with null values I am just doing normmally

df.dropna(inplace=True)

In [43]:
#Again the shape reduces

df.shape

(9969, 12)

In [46]:
import numpy as np

# If you want to ensure ' unit_price' is float and handle any conversion issues:
df[' unit_price'] = pd.to_numeric(df[' unit_price'], errors='coerce')

df.head()

C:\Users\DEVI PRASAD\AppData\Local\Temp\ipykernel_22580\1268783346.py:4: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df[' unit_price'] = pd.to_numeric(df[' unit_price'], errors='coerce')

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   invoice_id               9969 non-null   int64
 1    Branch                  9969 non-null   object
 2    City                    9969 non-null   object
 3    category                9969 non-null   object
 4    unit_price              9969 non-null   float64
 5    quantity                9969 non-null   float64
 6    date                    9969 non-null   object
 7    time                    9969 non-null   object
 8    payment_method          9969 non-null   object
 9    rating                  9969 non-null   float64
 10   profit_margin           9969 non-null   float64
 11   total                   9969 non-null   float64
dtypes: float64(5), int64(1), object(6)
memory usage: 1012.5+ KB

In [48]:
df.columns

Index(['invoice_id', ' Branch ', ' City                ',
       ' category              ', ' unit_price', ' quantity', ' date    ',
       ' time    ', ' payment_method', ' rating', ' profit_margin', ' total'],
      dtype='object')

In [49]:
df[' quantity'] = pd.to_numeric(df[' quantity'], errors='coerce')
df[' total'] = df[' unit_price'] * df[' quantity']
df.head()

C:\Users\DEVI PRASAD\AppData\Local\Temp\ipykernel_22580\1690039534.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df[' quantity'] = pd.to_numeric(df[' quantity'], errors='coerce')
C:\Users\DEVI PRASAD\AppData\Local\Temp\ipykernel_22580\1690039534.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df[' total'] = df[' unit_price'] * df[' quantity']

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [53]:
# mysql
# host = localhost
# port = 3306
# user = root
# password = 'deviprasad'

In [54]:
df.shape

(9969, 12)

In [55]:
df.to_csv('walmart_cleaned.csv', index=False)

In [56]:
engine_mysql =create_engine("mysql+pymysql://root:deviprasad@localhost:3306/walmart_db")
try:
    engine_mysql
    print("Connected to mysql")
except:
    print("unable to connect to mysql")

Connected to mysql

In [58]:
# Strip leading/trailing spaces from column names
df.columns = df.columns.str.strip()

df.to_sql(name='walmart', con=engine_mysql, if_exists='append', index=False)

9969

In [61]:
df.columns = df.columns.str.lower()
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'total'],
      dtype='object')